app/controllers/movies_controller.rb

  def index
    session[:sort] = params[:sort] if params[:sort]
    session[:ratings] = params[:ratings] if params[:ratings]

    if (!params[:ratings] || !params[:sort]) && session[:ratings] && session[:sort]
      flash.keep
      redirect_to movies_path :ratings => session[:ratings], :sort => session[:sort] and return
    elsif !params[:ratings] && session[:ratings]
      flash.keep
      redirect_to movies_path :ratings => session[:ratings] and return
    elsif !params[:sort] && session[:sort]
      flash.keep
      redirect_to movies_path :sort => session[:sort] and return
    end

    @all_ratings = Movie.ratings

    @checked_ratings = params[:ratings] ? params[:ratings].keys : @all_ratings
    @all_ratings = Movie.ratings
    if params[:sort] == "title"
      @movies = Movie.where(:rating => @checked_ratings).sort_by(&:title)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')